In [1]:
#Classification Problem: Loan Prediction problem
#we have kept working days as 100

import pandas as pd
df=pd.read_csv(r"C:\Users\Lakshya Pokharna\Downloads\train_loan (1).csv")
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Applicant Income per day,ApplicantIncome,Coapplicant Income per day,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,584900,0.0,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,458300,1508.0,150800.0,12800.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,300000,0.0,0.0,66000.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,258300,2358.0,235800.0,12000.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,600000,0.0,0.0,14100.0,360.0,1.0,Urban,Y

In [2]:
df.dtypes

Loan_ID                        object
Gender                         object
Married                        object
Dependents                     object
Education                      object
Self_Employed                  object
Applicant Income per day        int64
ApplicantIncome                 int64
Coapplicant Income per day    float64
CoapplicantIncome             float64
LoanAmount                    float64
Loan_Amount_Term              float64
Credit_History                float64
Property_Area                  object
Loan_Status                    object
dtype: object

In [3]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'Applicant Income per day', 'ApplicantIncome',
       'Coapplicant Income per day', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [4]:
#Removing 'Loan_ID' feature because it does not play any significant role in machine learning

del df['Loan_ID']
df.head()

,Gender,Married,Dependents,Education,Self_Employed,Applicant Income per day,ApplicantIncome,Coapplicant Income per day,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,5849,584900,0.0,0.0,NaN,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,4583,458300,1508.0,150800.0,12800.0,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,300000,0.0,0.0,66000.0,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,258300,2358.0,235800.0,12000.0,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,600000,0.0,0.0,14100.0,360.0,1.0,Urban,Y

In [5]:
#Prepare independent/input features
X=df.drop("Loan_Status", axis=1)
X.head()

,Gender,Married,Dependents,Education,Self_Employed,Applicant Income per day,ApplicantIncome,Coapplicant Income per day,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,Male,No,0,Graduate,No,5849,584900,0.0,0.0,NaN,360.0,1.0,Urban
1,Male,Yes,1,Graduate,No,4583,458300,1508.0,150800.0,12800.0,360.0,1.0,Rural
2,Male,Yes,0,Graduate,Yes,3000,300000,0.0,0.0,66000.0,360.0,1.0,Urban
3,Male,Yes,0,Not Graduate,No,2583,258300,2358.0,235800.0,12000.0,360.0,1.0,Urban
4,Male,No,0,Graduate,No,6000,600000,0.0,0.0,14100.0,360.0,1.0,Urban

In [6]:
#Prepare Dependent/outcome feature

y=df['Loan_Status']
y.head()

0    Y
1    N
2    Y
3    Y
4    Y
Name: Loan_Status, dtype: object

In [7]:
#Checking missing values in each columns of the X

X.isnull().sum()

Gender                        13
Married                        3
Dependents                    15
Education                      0
Self_Employed                 32
Applicant Income per day       0
ApplicantIncome                0
Coapplicant Income per day     0
CoapplicantIncome              0
LoanAmount                    10
Loan_Amount_Term              14
Credit_History                50
Property_Area                  0
dtype: int64

In [8]:
X.dtypes

Gender                         object
Married                        object
Dependents                     object
Education                      object
Self_Employed                  object
Applicant Income per day        int64
ApplicantIncome                 int64
Coapplicant Income per day    float64
CoapplicantIncome             float64
LoanAmount                    float64
Loan_Amount_Term              float64
Credit_History                float64
Property_Area                  object
dtype: object

In [9]:
#Filling missing data in Categorical Features/columns

#Filling missing data in 'Gender'

#First count the frequency of each category in 'Gender'

X.Gender.value_counts()

Male      489
Female    112
Name: Gender, dtype: int64

In [10]:
#then, fill the missing data with highest frequency category

X.Gender.fillna('Male', inplace=True)
X.isnull().sum()

Gender                         0
Married                        3
Dependents                    15
Education                      0
Self_Employed                 32
Applicant Income per day       0
ApplicantIncome                0
Coapplicant Income per day     0
CoapplicantIncome              0
LoanAmount                    10
Loan_Amount_Term              14
Credit_History                50
Property_Area                  0
dtype: int64

In [11]:
#filling missing data in 'Married'

#First count the frequency of each category in 'Married'

X.Married.value_counts()

Yes    398
No     213
Name: Married, dtype: int64

In [12]:
#then, fill the missing data with highest frequency category

X.Married.fillna('Yes', inplace=True)
X.isnull().sum()

Gender                         0
Married                        0
Dependents                    15
Education                      0
Self_Employed                 32
Applicant Income per day       0
ApplicantIncome                0
Coapplicant Income per day     0
CoapplicantIncome              0
LoanAmount                    10
Loan_Amount_Term              14
Credit_History                50
Property_Area                  0
dtype: int64

In [13]:
#filling missing data in 'Dependents'

#First count the frequency of each category in 'Dependents'

X.Dependents.value_counts()

0     345
1     102
2     101
3+     51
Name: Dependents, dtype: int64

In [14]:
#then, fill the missing data with highest frequency category

X.Dependents.fillna('0', inplace=True)
X.isnull().sum()

Gender                         0
Married                        0
Dependents                     0
Education                      0
Self_Employed                 32
Applicant Income per day       0
ApplicantIncome                0
Coapplicant Income per day     0
CoapplicantIncome              0
LoanAmount                    10
Loan_Amount_Term              14
Credit_History                50
Property_Area                  0
dtype: int64

In [15]:
#filling missing data in 'Self_Employed'

#First count the frequency of each category in 'Self_Employed'

X.Self_Employed.value_counts()

No     500
Yes     82
Name: Self_Employed, dtype: int64

In [16]:
#then, fill the missing data with highest frequency category

X.Self_Employed.fillna('No', inplace=True)
X.isnull().sum()

Gender                         0
Married                        0
Dependents                     0
Education                      0
Self_Employed                  0
Applicant Income per day       0
ApplicantIncome                0
Coapplicant Income per day     0
CoapplicantIncome              0
LoanAmount                    10
Loan_Amount_Term              14
Credit_History                50
Property_Area                  0
dtype: int64

In [17]:
#Fill missing data in Numerical Features
import numpy as np

#Fill the missing data in Numerical features with their mean value

X.LoanAmount.fillna(np.mean(X.LoanAmount), inplace=True)
X.isnull().sum()

Gender                         0
Married                        0
Dependents                     0
Education                      0
Self_Employed                  0
Applicant Income per day       0
ApplicantIncome                0
Coapplicant Income per day     0
CoapplicantIncome              0
LoanAmount                     0
Loan_Amount_Term              14
Credit_History                50
Property_Area                  0
dtype: int64

In [18]:
#Fill missing data in 'Loan_Amount_Term'

X.Loan_Amount_Term.fillna(np.mean(X.Loan_Amount_Term), inplace=True)
X.isnull().sum()

Gender                         0
Married                        0
Dependents                     0
Education                      0
Self_Employed                  0
Applicant Income per day       0
ApplicantIncome                0
Coapplicant Income per day     0
CoapplicantIncome              0
LoanAmount                     0
Loan_Amount_Term               0
Credit_History                50
Property_Area                  0
dtype: int64

In [19]:
#filling missing data in 'Credit_History'

X.Credit_History.value_counts()

1.0    475
0.0     89
Name: Credit_History, dtype: int64

In [20]:
X.Credit_History.fillna(1.0, inplace=True)
X.isnull().sum()

Gender                        0
Married                       0
Dependents                    0
Education                     0
Self_Employed                 0
Applicant Income per day      0
ApplicantIncome               0
Coapplicant Income per day    0
CoapplicantIncome             0
LoanAmount                    0
Loan_Amount_Term              0
Credit_History                0
Property_Area                 0
dtype: int64

In [21]:
#Encoding Categorical features of X into numerical type using One-hot encoding

X=pd.get_dummies(X)
X.head()

,Applicant Income per day,ApplicantIncome,Coapplicant Income per day,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Female,Gender_Male,Married_No,...,Dependents_1,Dependents_2,Dependents_3+,Education_Graduate,Education_Not Graduate,Self_Employed_No,Self_Employed_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban
0,5849,584900,0.0,0.0,20751.009934,360.0,1.0,0,1,1,...,0,0,0,1,0,1,0,0,0,1
1,4583,458300,1508.0,150800.0,12800.000000,360.0,1.0,0,1,0,...,1,0,0,1,0,1,0,1,0,0
2,3000,300000,0.0,0.0,66000.000000,360.0,1.0,0,1,0,...,0,0,0,1,0,0,1,0,0,1
3,2583,258300,2358.0,235800.0,12000.000000,360.0,1.0,0,1,0,...,0,0,0,0,1,1,0,0,0,1
4,6000,600000,0.0,0.0,14100.000000,360.0,1.0,0,1,1,...,0,0,0,1,0,1,0,0,0,1

In [22]:
#Splitting the data into training set and testing set

from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test=train_test_split(X,y, test_size=0.2, random_state=42)

In [23]:
print(X_train.shape)
print(y_train.shape)

print(X_test.shape)
print(y_test.shape)

(491, 22)
(491,)
(123, 22)
(123,)

In [24]:
X_train.head()

,Applicant Income per day,ApplicantIncome,Coapplicant Income per day,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Female,Gender_Male,Married_No,...,Dependents_1,Dependents_2,Dependents_3+,Education_Graduate,Education_Not Graduate,Self_Employed_No,Self_Employed_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban
83,6000,600000,2250.0,225000.0,26500.0,360.0,1.0,0,1,0,...,0,0,0,1,0,1,0,0,1,0
90,2958,295800,2900.0,290000.0,13100.0,360.0,1.0,0,1,0,...,0,0,0,1,0,1,0,0,1,0
227,6250,625000,1695.0,169500.0,13800.0,360.0,1.0,0,1,0,...,0,1,0,1,0,1,0,0,1,0
482,2083,208300,3150.0,315000.0,12800.0,360.0,1.0,0,1,0,...,0,0,0,1,0,1,0,0,1,0
464,4166,416600,0.0,0.0,9800.0,360.0,0.0,0,1,1,...,0,0,0,1,0,1,0,0,1,0

In [25]:
X_test.head()

,Applicant Income per day,ApplicantIncome,Coapplicant Income per day,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Female,Gender_Male,Married_No,...,Dependents_1,Dependents_2,Dependents_3+,Education_Graduate,Education_Not Graduate,Self_Employed_No,Self_Employed_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban
350,9083,908300,0.0,0.0,22800.0,360.0,1.0,0,1,0,...,0,0,0,1,0,1,0,0,1,0
377,4310,431000,0.0,0.0,13000.0,360.0,1.0,0,1,0,...,0,0,0,1,0,1,0,0,1,0
163,4167,416700,1447.0,144700.0,11300.0,360.0,1.0,0,1,0,...,0,1,0,1,0,1,0,1,0,0
609,2900,290000,0.0,0.0,7100.0,360.0,1.0,1,0,1,...,0,0,0,1,0,1,0,1,0,0
132,2718,271800,0.0,0.0,70000.0,360.0,1.0,0,1,1,...,0,0,0,1,0,1,0,0,1,0

In [26]:
#Applying RandomForestClassifier

from sklearn.ensemble import RandomForestClassifier

rfc=RandomForestClassifier()
rfc.fit(X_train, y_train)

RandomForestClassifier()

In [27]:
print('Score of RandomForesClassifier:', rfc.score(X_test, y_test))

Score of RandomForesClassifier: 0.7723577235772358

In [28]:
rfc_pred=rfc.predict(X_test)
rfc_pred[0:5]

array(['Y', 'Y', 'Y', 'Y', 'Y'], dtype=object)

In [29]:
y_test[0:5]

350    Y
377    Y
163    Y
609    Y
132    Y
Name: Loan_Status, dtype: object

In [30]:
from sklearn.metrics import confusion_matrix

RFC_pred=rfc.predict(X_test)
rfc_conf=confusion_matrix(y_test, RFC_pred)
rfc_conf

array([[19, 24],
       [ 4, 76]], dtype=int64)

In [31]:
#Preparing the dataframe for confusion matrix
rfc_conf_df=pd.DataFrame(rfc_conf, columns=["N", 'Y'], index=['N', 'Y'])
rfc_conf_df

    N   Y
N  19  24
Y   4  76

In [32]:
#Confusion Matrix for RandomForestClassifier

#Predicting the outcome of testing data using RandomForestClassifier

rfc_pred=rfc.predict(X_test)
rfc_conf=confusion_matrix(y_test, rfc_pred)

rfc_conf_df=pd.DataFrame(rfc_conf, columns=["N", 'Y'], index=['N', 'Y'])
rfc_conf_df

    N   Y
N  19  24
Y   4  76

In [33]:
#input new data

gender=input("Enter Your Gender(Male or Female):")
married=input('Enter Marital Status (No or Yes):')
depend=input('Enter Dependents (0/1/2/3+):')
edu=input('Enter Your Education(Graudate/Not Graduate):')
self=input("Enter self Employment status(Yes or NO):")
app=int(input('Enter Applicant Income (10000 to 8100000):'))
coapp=float(input('Enter Coapplicant Income(0 to 4166700):'))
loan=float(input('Enter Loan Amount(0 to 340900):'))
loanterm=float(input('Enter Loan Amount Term (65 to 480):'))
credit=float(input("Enter Credit History (0 or 1):"))
prop=input("Enter Property Area(Urban/Rural/Semiurban)=")

Enter Your Gender(Male or Female):Male
Enter Marital Status (No or Yes):Yes
Enter Dependents (0/1/2/3+):2
Enter Your Education(Graudate/Not Graduate):Graduate
Enter self Employment status(Yes or NO):Yes
Enter Applicant Income (10000 to 8100000):1050000
Enter Coapplicant Income(0 to 4166700):500000
Enter Loan Amount(0 to 340900):100000
Enter Loan Amount Term (65 to 480):120
Enter Credit History (0 or 1):1
Enter Property Area(Urban/Rural/Semiurban)=Urban

In [34]:
#first Arrange this data in a list

value=[[gender, married, depend,edu, self, app, coapp, loan, loanterm, credit, prop]]
value

[['Male',
  'Yes',
  '2',
  'Graduate',
  'Yes',
  1050000,
  500000.0,
  100000.0,
  120.0,
  1.0,
  'Urban']]

In [35]:
df.columns

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'Applicant Income per day', 'ApplicantIncome',
       'Coapplicant Income per day', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [36]:
#convert the list into dataframe

newdf=pd.DataFrame(value, columns=['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area'])
newdf

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,Male,Yes,2,Graduate,Yes,1050000,500000.0,100000.0,120.0,1.0,Urban

In [37]:
#Encoding categorical data of newdf into numerical one

newdf=pd.get_dummies(newdf)
newdf

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Male,Married_Yes,Dependents_2,Education_Graduate,Self_Employed_Yes,Property_Area_Urban
0,1050000,500000.0,100000.0,120.0,1.0,1,1,1,1,1,1

In [38]:
newdf.columns

Index(['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Gender_Male', 'Married_Yes',
       'Dependents_2', 'Education_Graduate', 'Self_Employed_Yes',
       'Property_Area_Urban'],
      dtype='object')

In [39]:
X_train.columns

Index(['Applicant Income per day', 'ApplicantIncome',
       'Coapplicant Income per day', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Gender_Female', 'Gender_Male',
       'Married_No', 'Married_Yes', 'Dependents_0', 'Dependents_1',
       'Dependents_2', 'Dependents_3+', 'Education_Graduate',
       'Education_Not Graduate', 'Self_Employed_No', 'Self_Employed_Yes',
       'Property_Area_Rural', 'Property_Area_Semiurban',
       'Property_Area_Urban'],
      dtype='object')

In [40]:
print("NO. of features/columns in Training data:", len(X_train.columns))
print("NO. of features/columns in New data:", len(newdf.columns))

NO. of features/columns in Training data: 22
NO. of features/columns in New data: 11

In [41]:
#If we apply/implement any ML algo on new data

#NO. of features/columns in newdata must match with the no. of columns/featues of training data

#Identify those features/columns which are available in X_train but not in newdf

missing_cols=set(X_train.columns)-set(newdf.columns)

print('Missing columns in newdf')
missing_cols

Missing columns in newdf

{'Applicant Income per day',
 'Coapplicant Income per day',
 'Dependents_0',
 'Dependents_1',
 'Dependents_3+',
 'Education_Not Graduate',
 'Gender_Female',
 'Married_No',
 'Property_Area_Rural',
 'Property_Area_Semiurban',
 'Self_Employed_No'}

In [42]:
#Adding these missing cols in newdf with 0 value

for i in missing_cols:
    newdf[i]=0

In [43]:
print("NO. of features/columns in Training data:", len(X_train.columns))
print("NO. of features/columns in New data:", len(newdf.columns))

NO. of features/columns in Training data: 22
NO. of features/columns in New data: 22

In [44]:
newdf

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Male,Married_Yes,Dependents_2,Education_Graduate,Self_Employed_Yes,...,Property_Area_Rural,Dependents_3+,Coapplicant Income per day,Dependents_1,Gender_Female,Applicant Income per day,Married_No,Property_Area_Semiurban,Self_Employed_No,Education_Not Graduate
0,1050000,500000.0,100000.0,120.0,1.0,1,1,1,1,1,...,0,0,0,0,0,0,0,0,0,0

In [45]:
#The order of the features/columns in new data must match with the order of features/columns in training
#data

#Arrange the columns of newdf as per X_train

newdf=newdf[X_train.columns]
newdf

,Applicant Income per day,ApplicantIncome,Coapplicant Income per day,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Female,Gender_Male,Married_No,...,Dependents_1,Dependents_2,Dependents_3+,Education_Graduate,Education_Not Graduate,Self_Employed_No,Self_Employed_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban
0,0,1050000,0,500000.0,100000.0,120.0,1.0,0,1,0,...,0,1,0,1,0,0,1,0,0,1

In [46]:
X_train.head(1)

,Applicant Income per day,ApplicantIncome,Coapplicant Income per day,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Female,Gender_Male,Married_No,...,Dependents_1,Dependents_2,Dependents_3+,Education_Graduate,Education_Not Graduate,Self_Employed_No,Self_Employed_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban
83,6000,600000,2250.0,225000.0,26500.0,360.0,1.0,0,1,0,...,0,0,0,1,0,1,0,0,1,0

In [47]:
#Now, our new data is ready for Machine Learning

#Predicting the value of Loan Status for this new data using Random Forest Classifier Model


new_prediction=rfc.predict(newdf)
new_prediction

array(['Y'], dtype=object)

In [48]:
if(new_prediction[0]=='Y'):
    print('Congrats! Your loan may be approved. Please contact branch')
else:
    print('Sorry! Your loan is not approved')

Congrats! Your loan may be approved. Please contact branch